CodingDojo_Ruby/rails_exercises/bright_ideas/app/views/users/show.html.erb

SELECT COUNT(*) FROM "ideas"  WHERE "ideas"."user_id" = $1  [["user_id", 1]]
SELECT COUNT(*) FROM "likes"  WHERE "likes"."user_id" = $1  [["user_id", 1]]
---
      <hr class="style1">
      <h3>Total Number of Post: <%=@user.ideas.count%></h3>
      <h3>Total Number of Likes: <%=@user.likes.count%></h3>