CodingDojo_Ruby/rails_exercises/ror_belt2/app/controllers/playlists_controller.rb

  def create
      @playlist = Playlist.create(user_id: session[:user_id], song_id: params[:song_id])
---
INSERT INTO "playlists" ("created_at", "song_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2016-11-22 23:02:22.891873"], ["song_id", 1], ["updated_at", "2016-11-22 23:02:22.891873"], ["user_id", 2]]