CodingDojo_Ruby/rails_exercises/ror_belt2/app/controllers/songs_controller.rb

SELECT "songs".* FROM "songs"   ORDER BY "songs"."created_at" DESC
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
---
  def index
    @songs = Song.all.order(created_at: :desc)
    @user = User.find(session[:user_id])

INSERT INTO "songs" ("artist", "created_at", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artist", "Madonna"], ["created_at", "2016-11-22 23:04:49.486143"], ["title", "name"], ["updated_at", "2016-11-22 23:04:49.486143"]]
---
  def create
    @song = Song.create(title: params[:title], artist: params[:artist])

SELECT  "songs".* FROM "songs"  WHERE "songs"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @song = Song.find(params[:id])
    @user = User.find(session[:user_id])