CodingDojo_Ruby/rails_exercises/ror_belt2/app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "first_name", "last_name", "password_digest", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
SELECT  1 AS one FROM "users"  WHERE LOWER("users"."email") = LOWER('hkang10@gmail.com') LIMIT 1
---
  def create
    @user = User.create(first_name: params[:first_name], last_name: params[:last_name], email: params[:email], password: params[:password])

    if @user.errors.full_messages.empty?

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "playlists".* FROM "playlists"  WHERE "playlists"."user_id" = 2 AND "playlists"."song_id" = 2 LIMIT 1
---
  def show
    @user = User.find(session[:user_id])
    @song = Playlist.find_by(user_id: @user.id, song_id: @user)