CodingDojo_Ruby/rails_exercises/product_dashboard2/app/controllers/products_controller.rb

DELETE FROM "products" WHERE "products"."id" = $1  [["id", 1]]
SELECT  "products".* FROM "products"  WHERE "products"."id" = $1 LIMIT 1  [["id", 1]]
---
  def destroy
    @product = Product.find(params[:id]).destroy

SELECT  "categories".* FROM "categories"  WHERE "categories"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "products" ("created_at", "description", "name", "pricing", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2016-11-21 18:05:26.911345"], ["description", "test"], ["name", "test"], ["pricing", 90.0], ["updated_at", "2016-11-21 18:05:26.911345"]]
---
  def create
    puts product_params[:category]
    category = Category.find(product_params[:category])
    product = Product.new(name: params[:name], description: products_params[:description], pricing: products_params[:pricing], category: category)
   if product.save

SELECT  "products".* FROM "products"  WHERE "products"."id" = $1 LIMIT 1  [["id", 5]]
UPDATE "products" SET "description" = $1, "pricing" = $2, "updated_at" = $3 WHERE "products"."id" = 5  [["description", "Luisa"], ["pricing", 0.0], ["updated_at", "2016-11-21 20:17:17.819176"]]
---
  def update
    @categories = Category.find(product_params[:category])
    @product = Product.find(params[:id])
    @product.update(product_params)