CodingDojo_Ruby/rails_exercises/bright_ideas/app/views/ideas/index.html.erb

    </form>
    <a href="/ideas/<%=each_idea.id%>"><%=each_idea.likes.count%> people</a><span> like this</span> <br>
---
SELECT COUNT(*) FROM "likes"  WHERE "likes"."idea_id" = $1  [["idea_id", 1]]