CodingDojo_Ruby/rails_exercises/online_lending/app/views/borrowers/show.html.erb

SELECT "lenders".* FROM "lenders" INNER JOIN "histories" ON "lenders"."id" = "histories"."lender_id" WHERE "histories"."borrower_id" = $1  [["borrower_id", 1]]
---
      <tbody>
        <% @borrower.lenders.each do |lender|%>