CodingDojo_Ruby/rails_exercises/products dashboard i/app/controllers/products_controller.rb

  def create
    category = Category.find(products_params[:category])
    product = Product.new(name: products_params[:name], description: products_params[:description], pricing: products_params[:pricing], category: category)
    if product.save
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "products" ("name", "description", "pricing", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Pillow"], ["description", "Sleep better"], ["pricing", 10.0], ["category_id", 2], ["created_at", "2015-08-13 05:08:50.667932"], ["updated_at", "2015-08-13 05:08:50.667932"]]

  def edit
    @product = Product.find(params[:id])
    @categories = Category.all
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
SELECT "categories".* FROM "categories"

  def update
    category = Category.find(products_params[:category])
    product = Product.find(params[:id])
    product.update(name: products_params[:name], description: products_params[:description], pricing: products_params[:pricing], category: category)
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "products" SET "name" = ?, "description" = ?, "pricing" = ?, "category_id" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["name", "Hose"], ["description", "Water down your plants"], ["pricing", 15.0], ["category_id", 3], ["updated_at", "2015-08-13 05:37:41.624126"], ["id", 3]]

  def destroy
    product = Product.find(params[:id])
    product.destroy
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 1]]