CodingDojo_Ruby/rails_exercises/bright_ideas/app/controllers/ideas_controller.rb

SELECT "ideas".* FROM "ideas"   ORDER BY "ideas"."created_at" DESC
---
  def index
    @ideas = Idea.all.order(created_at: :desc)

INSERT INTO "ideas" ("created_at", "idea", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2016-11-27 21:35:02.997844"], ["idea", "sdfsdf"], ["updated_at", "2016-11-27 21:35:02.997844"], ["user_id", 1]]
---
  def create
    @idea = Idea.create(idea: params[:new_idea], user_id: session[:user_id])

SELECT  "ideas".* FROM "ideas"  WHERE "ideas"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @each_idea = Idea.find(params[:id])

DELETE FROM "ideas" WHERE "ideas"."id" = $1  [["id", 1]]
SELECT  "ideas".* FROM "ideas"  WHERE "ideas"."id" = $1 LIMIT 1  [["id", 1]]
---
  def destroy
    @idea = Idea.find(params[:id]).destroy