CodingDojo_Ruby/rails_exercises/bright_ideas/app/controllers/likes_controller.rb

  def create
    @like = Like.create(user_id: session[:user_id], idea_id: params[:idea_id])
    if @like.errors.full_messages.empty?
---
INSERT INTO "likes" ("created_at", "idea_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2016-11-27 21:51:54.880201"], ["idea_id", 1], ["updated_at", "2016-11-27 21:51:54.880201"], ["user_id", 1]]
SELECT  1 AS one FROM "likes"  WHERE ("likes"."user_id" = 2 AND "likes"."idea_id" = 6) LIMIT 1