CodingDojo_Ruby/rails_exercises/bright_ideas/app/controllers/users_controller.rb

  def create
    @user = User.create(name: params[:name], alias: params[:alias], email: params[:email], password: params[:password], password_confirmation: params[:password_confirmation])

    if @user.errors.full_messages.empty?
---
INSERT INTO "users" ("alias", "created_at", "email", "name", "password_digest", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
SELECT  1 AS one FROM "users"  WHERE LOWER("users"."email") = LOWER('agheewala1231@gmail.com') LIMIT 1