CodingDojo_Ruby/rails_exercises/ror_belt2/app/views/songs/index.html.erb

          <td> <a href="/songs/<%=song.id%>"><%= song.title.capitalize%></a></td>
          <td><%= song.playlists.count%></td>
---
SELECT COUNT(*) FROM "playlists"  WHERE "playlists"."song_id" = $1  [["song_id", 1]]