CodingDojo_Ruby/rails_exercises/ror_belt2/app/views/songs/show.html.erb

      <tbody>
        <%@song.playlists.each do |playlist|%>
        <tr>
          <td> <a href="/users/<%=@user.id%>"><%=playlist.user.first_name.capitalize%> <%=playlist.user.last_name.capitalize%></a></td>
---
SELECT "playlists".* FROM "playlists"  WHERE "playlists"."song_id" = $1  [["song_id", 1]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]