CodingDojo_Ruby/rails_exercises/online_lending/app/controllers/borrowers_controller.rb

INSERT INTO "borrowers" ("created_at", "description", "email", "first_name", "last_name", "money", "password_digest", "purpose", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
SELECT  1 AS one FROM "borrowers"  WHERE LOWER("borrowers"."email") = LOWER('salas.luis40@gmail.com') LIMIT 1
---
  def create
    @borrower = Borrower.create(first_name: params[:first_name], last_name: params[:last_name], email: params[:email], password: params[:password], money: params[:amount_needed], purpose: params[:purpose], description: params[:description])
    puts @borrower

    if @borrower.errors.full_messages.empty?

SELECT  "borrowers".* FROM "borrowers"  WHERE "borrowers"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @borrower = Borrower.find(params[:id])