CodingDojo_Ruby/rails_exercises/online_lending/app/controllers/histories_controller.rb

  def create
    @history = History.create(amount: params[:amount],lender_id: params[:id], borrower_id: params[:borrower_id] )
---
INSERT INTO "histories" ("amount", "borrower_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["amount", 999], ["borrower_id", 4], ["created_at", "2016-11-21 16:04:26.163526"], ["updated_at", "2016-11-21 16:04:26.163526"]]