CodingDojo_Ruby/rails_exercises/online_lending/app/controllers/lenders_controller.rb

SELECT "lenders".* FROM "lenders"
---
  def index
    @lenders = Lender.all

INSERT INTO "lenders" ("created_at", "email", "first_name", "last_name", "money", "password_digest", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
SELECT  1 AS one FROM "lenders"  WHERE LOWER("lenders"."email") = LOWER('Tom@tom.com') LIMIT 1
---
  def create
    @lender = Lender.create(first_name: params[:first_name], last_name: params[:last_name], email: params[:email], password: params[:password], money: params[:money])

    if @lender.errors.full_messages.empty?

SELECT  "lenders".* FROM "lenders"  WHERE "lenders"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "borrowers".* FROM "borrowers"
---
  def show
    @lender = Lender.find(params[:id])
    @borrowers = Borrower.all