CodingDojo_Ruby/rails_exercises/online_lending/app/controllers/sessions_controller.rb

  def login
    @lender = Lender.find_by(email: params[:email])
---
SELECT  "lenders".* FROM "lenders"  WHERE "lenders"."email" = 'Tom@tom.com' LIMIT 1

  def login_borrower
    @borrower = Borrower.find_by(email: params[:email])
---
SELECT  "borrowers".* FROM "borrowers"  WHERE "borrowers"."email" = 'hkang10@gmail.com' LIMIT 1