CodingDojo_Ruby/rails_exercises/online_lending/app/views/lenders/show.html.erb

    <tbody>
      <% @lender.borrowers.each do |borrower| %>
---
SELECT "borrowers".* FROM "borrowers" INNER JOIN "histories" ON "borrowers"."id" = "histories"."borrower_id" WHERE "histories"."lender_id" = $1  [["lender_id", 1]]